InformationRegisters/ххх_КодыНоменклатурыВесыКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ххх_КодыНоменклатурыВесыКассы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инкримента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДляСостава</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ххх_ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ххх_КодыНоменклатурыВесыКассы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Запись.Инкримента=0
КонецПроцедуры


Функция йцу()
	Если Запись.Инкримента=0 Тогда
		Запрос=Новый запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	ххх_КодыНоменклатурыВесыКассы.Инкримента КАК Инкримента
		             |ИЗ
		             |	РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассы
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Инкримента УБЫВ";
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если выборка.Инкримента<2 Тогда
				СтараяИнкримента=2;
			Иначе
				СтараяИнкримента=выборка.Инкримента;	
			КонецЕсли;
		Иначе
			СтараяИнкримента=1;
		КонецЕсли;
		Запись.Инкримента=СтараяИнкримента+1;
	кОНЕЦеСЛИ;
	
	
	наб=РегистрыСведений.ххх_КодыНоменклатурыВесыКассы.СоздатьНаборЗаписей();
	наб.Отбор.Оборудование.установить(Запись.оборудование);
	наб.Прочитать();
	нОМЕРА=нАБ.ВыгрузитьКолонку("НомерДляСостава");
	НомерДляСостава=1;		
	Пока ЗначениеЗаполнено(нОМЕРА.Найти(НомерДляСостава)) или нОМЕРА.Найти(НомерДляСостава)=0 Цикл
		НомерДляСостава=НомерДляСостава+1;
	КонецЦикла;
	Запись.НомерДляСостава=НомерДляСостава;

КонецФункции



Функция ПолучитьПоследниюЯчейкуНаВесах()	
	
	Если Значениезаполнено(запись.Оборудование) Тогда
		
		Запрос=Новый запрос;
		Запрос.УстановитьПараметр("Весы",запись.Оборудование);
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	ххх_КодыНоменклатурыВесыКассы.Код КАК Код,
		             |	ххх_КодыНоменклатурыВесыКассы.Оборудование КАК Оборудование
		             |ИЗ
		             |	РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассы
		             |ГДЕ
		             |	ххх_КодыНоменклатурыВесыКассы.Оборудование = &весы
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Код УБЫВ";
		выборка=Запрос.Выполнить().Выбрать();
		Если выборка.Следующий() Тогда
			ЗАпись.Код=Выборка.Код+1;
		Иначе
			Запись.Код=1;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	ПолучитьПоследниюЯчейкуНаВесах()
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверкаПрав(Отказ);
	Если не отказ Тогда
		йцу();
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаПрав(Отказ)
	
	
	Если Запись.Оборудование.type=3 и не РольДоступна("ПолныеПрава") Тогда
		отказ=истина;
		Сообщить("Не достаточно прав.");
	КонецЕСли;
	
КонецПроцедуры
